MPS/src/Catalogs/ПрограммыАкций/ПрограммыАкций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрограммыАкций</name>
  <attributes>
    <name>ДатаНачалаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПослеЗапуска</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстановкаВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>CatalogRef.ЧасовыеПояса</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАкции</name>
    <type>
      <types>EnumRef.ТипыАкций</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментКлиентов</name>
    <type>
      <types>CatalogRef.СегментыПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтбораПоКлиентам</name>
    <type>
      <types>EnumRef.ЕстьНетНеВажно</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьПоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОграничиватьВремяСрабатывания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДниНедели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьПоПромокодам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборПромокодов</name>
    <type>
      <types>CatalogRef.НаборыПромокодов</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьНесколькоПромокодовВЗаказе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПромокодовВЗаказе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьПоКаналам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьПоЗонам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьПоПродуктам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОграниченияПоПродуктам</name>
    <type>
      <types>EnumRef.ВариантыОграниченияПоПродуктам</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментНоменклатурыПоПродуктам</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьЗаказыПоПродуктам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиЗаказовПоПродуктам</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеАкцииПоПродуктам</name>
    <type>
      <types>EnumRef.ДействияВАкциях</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиЗаказов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьЛимитОбщийКоличество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьЛимитОбщийСумма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьЛимитПерсональныйКоличество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьЛимитПерсональныйСумма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитОбщийКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитОбщийСумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитПерсональныйКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитПерсональныйСумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЛимитаОбщийКоличество</name>
    <type>
      <types>EnumRef.ПериодыДействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЛимитаОбщийСумма</name>
    <type>
      <types>EnumRef.ПериодыДействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЛимитаПерсональныйКоличество</name>
    <type>
      <types>EnumRef.ПериодыДействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЛимитаПерсональныйСумма</name>
    <type>
      <types>EnumRef.ПериодыДействий</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовЛимитаОбщийКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовЛимитаОбщийСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовЛимитаПерсональныйКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовЛимитаПерсональныйСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КаналыОтбор</name>
    <attributes>
      <name>ЗначениеОтбора</name>
      <type>
        <types>CatalogRef.Каналы</types>
        <types>CatalogRef.ВидыКаналов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗоныДоставкиОтбор</name>
    <attributes>
      <name>ЗначениеОтбора</name>
      <type>
        <types>CatalogRef.ЗоныДоставки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыОтбор</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДействияАкцииПоЗаказам</name>
    <attributes>
      <name>ДействиеАкции</name>
      <type>
        <types>EnumRef.ДействияВАкциях</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Процент/сумма скидки/начисления в рублях/баллах </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоАбсолютноеКоличество</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>БалльныйСчет</name>
      <type>
        <types>CatalogRef.ВидыБалльныхСчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальнаяСтоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПериодаДоступности</name>
      <type>
        <types>EnumRef.ПередСразуПослеДатой</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

MPS/src/Enums/ЕстьНетНеВажно/ЕстьНетНеВажно.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЕстьНетНеВажно</name>
  <enumValues>
    <name>Есть</name>
  </enumValues>
  <enumValues>
    <name>Нет</name>
  </enumValues>
  <enumValues>
    <name>НеВажно</name>
  </enumValues>
</mdclass:Enum>

MPS/src/Enums/СтатусыСценариев/СтатусыСценариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСценариев</name>
  <enumValues>
    <name>ГотовКЗапуску</name>
  </enumValues>
  <enumValues>
    <name>Запущен</name>
  </enumValues>
  <enumValues>
    <name>Остановлен</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
</mdclass:Enum>

MPS/src/Catalogs/ПрограммыАкций/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоЗаказам", "НастройкиЗаказовПоПродуктам", Компоновщик_ЗаказыПоПродуктам);
	КомпоновкаИРасписание_ПКМП.ИнициализацияКомпоновки(ЭтотОбъект, "ФильтрПоЗаказам", "НастройкиЗаказов", Компоновщик_ПоЗаказам);
	
	
	СлужебныйПКМП.ДеньНеделиВремяПриСозданииФормы(ЭтотОбъект,,,Ложь);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Для ПозДеньНедели = 1 по СтрДлина(Объект.ДниНедели) Цикл
			КнопкаДня = Элементы["ДеньНедели"+Сред(Объект.ДниНедели,ПозДеньНедели,1)];
			КнопкаДня.Пометка = Истина;
			КнопкаДня.ЦветФона = Новый Цвет(72,215,44);
		КонецЦИкла;	
	КонецЕсли;	

	ВидимостьПериодаВыполнения();
	Элементы.ЧасовойПояс.ПодсказкаВвода = Константы.ЧасовойПоясПоУмолчанию.Получить();
	ПолучитьСтатус();
	
	Если не Параметры.Ключ.Пустая() Тогда
		Элементы.ТипАкции.ТолькоПросмотр = Истина;		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//проверка компоновщика на заполнение
	КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект, ТекущийОбъект, "НастройкиЗаказовПоПродуктам", "Компоновщик_ЗаказыПоПродуктам",
		Отказ);
	//проверка компоновщика на заполнение
	КомпоновкаИРасписание_ПКМП.ПередЗаписьюОтбораКомпоновкиНаСервере(ЭтотОбъект, ТекущийОбъект, "НастройкиЗаказов", "Компоновщик_ПоЗаказам",
		Отказ);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидимостьПериодаВыполненияНаКлиенте(Элемент)
	ВидимостьПериодаВыполнения();
КонецПроцедуры

&НаСервере
Процедура ВидимостьПериодаВыполнения()
	Элементы.ДатаНачалаВыполнения.Видимость = не Объект.НачалоПослеЗапуска;
	Элементы.ДатаОстановки.Видимость = не Объект.ОстановкаВручную;
	Элементы.ЧасовойПояс.Видимость = не Объект.НачалоПослеЗапуска или не Объект.ОстановкаВручную;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПромокодовВЗаказеПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьПоПромокодамПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьНесколькоПромокодовВЗаказеПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ВидОтбораПоКлиентамПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
	Для каждого ДекорацияСвертки из ЭтотОбъект.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ДекорацияСвертки) = Тип("ДекорацияФормы") и СтрНачинаетсяС(ДекорацияСвертки.Имя,"Свертка") Тогда
			СверткаНажатие(ДекорацияСвертки);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТипАкцииПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьПоВремениПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
	//контрагенты
	Элементы.СегментКлиентов.Видимость = не(Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.НеВажно"));
	
	//промокоды доступности
	Элементы.ГруппаОграничитьПоПромокодам.Видимость = Объект.ОграничитьПоПромокодам;
	
	Если Объект.ОграничитьПоПромокодам Тогда
		Если Объект.РазрешитьНесколькоПромокодовВЗаказе Тогда
			Элементы.ДекорацияПромокоды1.Заголовок = "Разрешить использовать до";
			Элементы.ДекорацияПромокоды2.Заголовок = "промо"+Склонение("код",Объект.КоличествоПромокодовВЗаказе,"Родительный");
			Элементы.ДекорацияПромокоды2.Видимость = Истина;
			Элементы.КоличествоПромокодовВЗаказе.Видимость = Истина;
		Иначе
			Элементы.ДекорацияПромокоды1.Заголовок = "Разрешить использовать несколько промокодов";
			Элементы.ДекорацияПромокоды2.Видимость = Ложь;
			Элементы.КоличествоПромокодовВЗаказе.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;		
	//время доступности
	Элементы.ГруппаДеньНеделиВремя.Видимость = Объект.ОграничитьПоВремени;
	Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Неопределено);
	
	//
КонецПроцедуры

&НаКлиенте
Процедура СверткаНажатие(Элемент)
	
	ИДГруппы =  СтрЗаменить(Элемент.Имя,"Свертка","");
	Группа = Элементы[СтрЗаменить(Элемент.Имя,"Свертка","Группа")];
	СделатьСвернутой = Группа.Видимость;
	Если СделатьСвернутой Тогда
		ЕстьОшибки = Ложь;
		ЗаголовокСвернутойГруппы = ПолучитьЗаголовокСвернутойГруппы(ИДГруппы, ЕстьОшибки);
		Элемент.Заголовок = "►"+СтрШаблон(" %1 : %2", ИДГруппы, ЗаголовокСвернутойГруппы);
		Если  ЕстьОшибки Тогда
			Элемент.ЦветТекста = WEBЦвета.Красный;
		Иначе
			Элемент.ЦветТекста = Новый Цвет(51,153,102);
		КонецЕсли;	
	Иначе
		Элемент.ЦветТекста = Новый Цвет(51,153,102);
		Элемент.Заголовок = "▼"+ИДГруппы;
	КонецЕсли;		
	
	Группа.Видимость = не СделатьСвернутой;
КонецПроцедуры


&НаКлиенте
Функция ПолучитьЗаголовокСвернутойГруппы(ИДГруппы, ЕстьОшибки)
	
	ЕстьОшибки = Ложь;
	ЗаголовокСвернутойГруппы = "";
	Если ИДГруппы  = "Контрагенты" Тогда
		Если Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.НеВажно") Тогда
			ЗаголовокСвернутойГруппы = "Для всех клиентов";
		Иначе
			Если Объект.СегментКлиентов.Пустая() Тогда
				ЕстьОшибки = Истина;
				ЗаголовокСвернутойГруппы = "Не указан сегмент клиентов";
			Иначе
				ЗаголовокСвернутойГруппы  = СтрШаблон("Для клиентов %1 из сегмента ""%2""",
							?(Объект.ВидОтбораПоКлиентам = ПредопределенноеЗначение("Перечисление.ЕстьНетНеВажно.Нет"),"не",""),Объект.СегментКлиентов);	
			КонецЕсли;	
		КонецЕсли;		
		
	КонецЕсли;
	Возврат ЗаголовокСвернутойГруппы;	
КонецФункции
#КонецОбласти	

#Область ПодключаемыеОбработчикиПериода
&НаКлиенте 
Процедура Подключаемая_НеОграничиватьВремяСрабатыванияПриИзменении(Элемент)
	
	Элементы.ГруппаВремя.Видимость = не Объект.НеОграничиватьВремяСрабатывания;
	
КонецПроцедуры	
	
&НаКлиенте 
Процедура Подключаемая_ВыбратьДеньНедели(Команда)
	
	АктивнаяКнопка = ТекущийЭлемент;
	Если не ТипЗнч(АктивнаяКнопка) = Тип("КнопкаФормы") Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаяКнопка.Пометка = не 	АктивнаяКнопка.Пометка;
	
	АктивнаяКнопка.ЦветФона = ?(АктивнаяКнопка.Пометка,Новый Цвет(72,215,44),Новый Цвет);
	
	Объект.ДниНедели = "";
	Для ДеньНедели = 1 по 7 Цикл
		Если Элементы["ДеньНедели"+ДеньНедели].Пометка Тогда
			Объект.ДниНедели = Объект.ДниНедели + ДеньНедели;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры
#КонецОбласти	



&НаСервере
Процедура ПолучитьСтатус()
	тмпСтатус = ОбработкаДанныхПКМП.ПолучитьСтатус(Объект.Ссылка);
	Статус = ?(не ЗначениеЗаполнено(тмпСтатус) , Перечисления.СтатусыСценариев.Черновик, тмпСтатус) ;
КонецПроцедуры	

&НаСервереБезКонтекста
Функция Склонение(ЗначениеИсходное, ЧисловоеЗначение, Падеж)
		СтрокаСклонения = ПолучитьСклоненияСтрокиПоЧислу(ЗначениеИсходное, ЧисловоеЗначение,,, "ПД="+Падеж)[0];
		мс = СтрРазделить(СтрокаСклонения," ");
		Возврат мс[1];
КонецФункции
